Revit 2027 API
IExternalApplication.OnStartup Method
Implement this method to execute some tasks when Autodesk Revit starts.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Result OnStartup(
	UIControlledApplication application
)
Function OnStartup (
	application As UIControlledApplication
) As Result
Result OnStartup(
	UIControlledApplication^ application
)
abstract OnStartup :
        application : UIControlledApplication -> Result
Parameters
application UIControlledApplication
A handle to the application being started.
Return Value
Result
Indicates if the external application completes its work successfully.
See Also
Reference
IExternalApplication Interface
Autodesk.Revit.UI Namespace